# -*- Mode: POLY-ORG ;-*- ---
#+TITLE: GENREC
#+AUTHOR: QH
** Lambda Calculus (de Brujin index)
#+begin_src lisp
(uiop:define-package #:genrec/experiments/lc
    (:mix #:cl #:genrec #:serapeum))
(in-package #:genrec/experiments/lc)
(define-adt lc
  (var (index nat))
  (lam (body lc))
  (app (op lc) (arg lc)))
(define-adt lcv
  (clo (env (list-of lcv)) (body lc))
  (bot))
(defun safe-nth (n l)
  (let ((cons (nthcdr n l)))
    (if cons (car cons) 'bot)))
(setf (get 'safe-nth 'arg-types) (lambda (r) `(nat (list-of ,r))))
(defproblem lc-apply (lcv lcv) lcv
  (op arg)
  (etypecase op
    (clo (lc (clo-body op) (cons arg (clo-env op))))
    ((eql bot) 'bot)))
(defproblem lc (lc (list-of lcv)) lcv
  (lc env)
  (etypecase lc
    (var (safe-nth (var-index lc) env))
    (app (lc-apply (lc (app-op lc) env)
                   (lc (app-arg lc) env)))
    (lam (clo env (lam-body lc)))))
(def lc-examples
  (inputs-to-examples
   #'lc
   (list (lam (var 0)) nil)
   (list (lam (var 1)) nil)
   (list (lam (var 0)) (list 'bot))
   (list (lam (var 1)) (list 'bot))
   (list (lam (var 1)) (list (clo nil (var 0))))
   (list (var 0) (list (clo nil (var 0))))
   (list (var 1) (list (clo nil (var 0))))
   (list (lam (lam (var 0))) nil)
   (list (app (lam (var 0)) (lam (var 0))) nil)
   (list (app (var 0) (var 0)) nil)
   (list (app (lam (var 0)) (var 0)) nil)
   (list (app (var 0) (lam (var 0))) nil)
   (list (app (app (lam (lam (var 0))) (lam (var 0))) (lam (var 0))) nil)
   (list (app (app (lam (lam (var 0))) (lam (var 1))) (lam (var 0))) nil)
   (list (app (app (lam (lam (var 0))) (lam (var 0))) (lam (var 1))) nil)
   (list (app (lam (lam (var 0))) (lam (var 0))) nil)
   (list (app (lam (lam (var 0))) (lam (var 1))) nil)
   (list (app (lam (lam (var 1))) (lam (var 0))) nil)))
(def lc-skeleton
  (population-skeleton
   (function (lcv lcv) lcv)
   (function (lcv lc (list-of lcv)) lcv)
   (function (lc (list-of lcv)) lcv)))
(def lc-library '((clo lcv) (safe-nth lcv)
                  (cons (list-of lcv))))
#+end_src

The following experiments are run with =*restart*= is set to 1M proposals (which never happens), so that we can observe behavior of single uninterrupted search traces. It's run with a version of skeleton that does /not/ generate recursive calls for non-recursive dispatch cases. Later revision removed this restriction, that does not help in this case (in fact making it slower because it introduces more parameters), but is more general. All runs find the solution successfully, but with a wide distribution of run time and iterations (accepted proposals). The latter ranges from 4K to 500K.

#+begin_src lisp :load no :results output verbatim
(def lc-skeleton
  (population-skeleton
   (function (lcv lcv) lcv)
   (function (lc (list-of lcv)) lcv)))
(with-profiling
  (pprint
   (solve-skeleton-one-try lc-skeleton lc-examples
                           '((safe-nth lcv) (clo lcv) (cons (list-of lcv)))))
  (terpri))
#+end_src

#+RESULTS:
#+begin_example :load no
  <INFO> [11:52:55] genrec - Profiling started
  <INFO> [11:52:55] genrec - Search stopped, 4421 accepted proposals.

((TRYABLE 3) (TRYABLE 5) (TRYABLE 6) (TRYABLE 3)
 (CONS (CLO (NIL) (VAR (ZERO))) (TRYABLE 2)) (SAFE-NTH (ZERO) (NIL))
 (SAFE-NTH (ZERO) (NIL)) (TRYABLE 1) (CONS (TRYABLE 3) (TRYABLE 0))
 (SAFE-NTH (ZERO) (CONS (BOT) (CONS (CLO (NIL) (VAR (ZERO))) (NIL))))
 (SAFE-NTH (TRYABLE 0) (TRYABLE 2)) (CLO (TRYABLE 6) (TRYABLE 4)) (TRYABLE 1)
 (TRYABLE 0) (TRYABLE 3) (TRYABLE 4) (TRYABLE 0) (CLO (NIL) (VAR (ZERO)))
 (TRYABLE 0) (TRYABLE 2) (TRYABLE 0) (TRYABLE 0) (TRYABLE 2) (TRYABLE 2)
 (TRYABLE 5) (TRYABLE 0) (SAFE-NTH (ZERO) (NIL)) (TRYABLE 1) (TRYABLE 3))
  <INFO> [11:52:55] genrec - Profiling ended. 5348 programs, 4420 accepted, 96264 evaluations, 131 evaluation errors, 0.198 s real time, 26981.3 p/s, 485664.3 e/s.
#+end_example

#+RESULTS:
#+begin_example :load no
  <INFO> [11:52:10] genrec - Profiling started
  <INFO> [11:52:39] genrec - Search stopped, 501055 accepted proposals.

((TRYABLE 3) (TRYABLE 1) (TRYABLE 5) (TRYABLE 3) (TRYABLE 2) (TRYABLE 4)
 (TRYABLE 3) (TRYABLE 1) (CONS (TRYABLE 3) (TRYABLE 0)) (TRYABLE 0)
 (SAFE-NTH (TRYABLE 0) (TRYABLE 2)) (TRYABLE 0) (CLO (NIL) (VAR (ZERO)))
 (TRYABLE 1) (TRYABLE 3) (TRYABLE 4) (CLO (NIL) (VAR (ZERO)))
 (CLO (TRYABLE 3) (TRYABLE 1)) (TRYABLE 0) (TRYABLE 2) (TRYABLE 0) (TRYABLE 0)
 (TRYABLE 2) (TRYABLE 2) (TRYABLE 5) (SAFE-NTH (ZERO) (NIL))
 (CLO (CONS (BOT) (CONS (SAFE-NTH (ZERO) (CONS (BOT) (NIL))) (TRYABLE 4)))
      (TRYABLE 2))
 (TRYABLE 1) (TRYABLE 3))
  <INFO> [11:52:39] genrec - Profiling ended. 776265 programs, 501054 accepted, 13972770 evaluations, 33886 evaluation errors, 28.604 s real time, 27138.2 p/s, 488487.3 e/s.
#+end_example

#+RESULTS:
#+begin_example :load no
  <INFO> [11:51:56] genrec - Profiling started
  <INFO> [11:51:58] genrec - Search stopped, 36033 accepted proposals.

((TRYABLE 1) (TRYABLE 5) (TRYABLE 2) (TRYABLE 3) (CONS (TRYABLE 5) (TRYABLE 2))
 (CLO (TRYABLE 1) (VAR (ZERO))) (CLO (TRYABLE 1) (VAR (ZERO))) (TRYABLE 1)
 (TRYABLE 0) (SAFE-NTH (ZERO) (NIL)) (SAFE-NTH (TRYABLE 0) (TRYABLE 2))
 (TRYABLE 2) (CLO (NIL) (VAR (ZERO))) (SAFE-NTH (ZERO) (NIL)) (TRYABLE 2)
 (TRYABLE 4) (CLO (TRYABLE 3) (VAR (ZERO))) (CLO (TRYABLE 3) (TRYABLE 1))
 (TRYABLE 1) (TRYABLE 2) (TRYABLE 0) (TRYABLE 2) (TRYABLE 0) (TRYABLE 3)
 (TRYABLE 5) (CLO (CONS (BOT) (TRYABLE 4)) (TRYABLE 3)) (TRYABLE 0) (TRYABLE 0)
 (TRYABLE 3))
  <INFO> [11:51:58] genrec - Profiling ended. 49538 programs, 36032 accepted, 891684 evaluations, 2111 evaluation errors, 1.777 s real time, 27878.4 p/s, 501810.4 e/s.
#+end_example

#+RESULTS:
#+begin_example :load no
  <INFO> [11:51:32] genrec - Profiling started
  <INFO> [11:51:34] genrec - Search stopped, 34637 accepted proposals.

((TRYABLE 3) (SAFE-NTH (ZERO) (TRYABLE 3)) (TRYABLE 0) (TRYABLE 3) (TRYABLE 2)
 (TRYABLE 3) (TRYABLE 0) (TRYABLE 1) (CONS (TRYABLE 3) (TRYABLE 0)) (TRYABLE 0)
 (SAFE-NTH (TRYABLE 0) (TRYABLE 2)) (TRYABLE 2) (TRYABLE 2) (TRYABLE 1)
 (TRYABLE 2) (CONS (BOT) (TRYABLE 4)) (CLO (NIL) (VAR (ZERO)))
 (CLO (TRYABLE 3) (TRYABLE 1)) (TRYABLE 1) (TRYABLE 2) (TRYABLE 0) (TRYABLE 0)
 (TRYABLE 2) (TRYABLE 2) (TRYABLE 5) (TRYABLE 0) (TRYABLE 0) (TRYABLE 1)
 (TRYABLE 3))
  <INFO> [11:51:34] genrec - Profiling ended. 45056 programs, 34636 accepted, 811008 evaluations, 1627 evaluation errors, 1.642 s real time, 27443.6 p/s, 493984.2 e/s.
#+end_example

#+RESULTS:
#+begin_example :load no
  <INFO> [11:50:57] genrec - Profiling started
  <INFO> [11:50:59] genrec - Search stopped, 48035 accepted proposals.

((TRYABLE 1) (TRYABLE 1) (TRYABLE 0) (TRYABLE 3) (CONS (TRYABLE 5) (TRYABLE 2))
 (CLO (NIL) (VAR (ZERO))) (TRYABLE 3) (TRYABLE 1) (CONS (BOT) (TRYABLE 0))
 (SAFE-NTH (ZERO) (NIL)) (SAFE-NTH (TRYABLE 0) (TRYABLE 2)) (TRYABLE 2)
 (CLO (NIL) (VAR (ZERO))) (TRYABLE 0) (TRYABLE 3) (TRYABLE 4)
 (CLO (NIL) (VAR (ZERO))) (CLO (TRYABLE 3) (TRYABLE 1)) (TRYABLE 1) (TRYABLE 2)
 (TRYABLE 0) (TRYABLE 2) (TRYABLE 0) (TRYABLE 3) (TRYABLE 5)
 (CLO (TRYABLE 4) (VAR (ZERO))) (SAFE-NTH (ZERO) (CONS (BOT) (NIL)))
 (TRYABLE 0) (TRYABLE 3))
  <INFO> [11:50:59] genrec - Profiling ended. 61539 programs, 48034 accepted, 1107702 evaluations, 2046 evaluation errors, 2.271 s real time, 27098.9 p/s, 487779.3 e/s.
#+end_example

Curiously, using a =nested-dispatch-skeleton= roughly equivalent to an "inlined" version of the above =population-skeleton= also solves the problem, but in very consistent time (10K~20K accepted proposals).
#+begin_src lisp :load no :results output verbatim
(def lc-skeleton
  (nested-dispatch-skeleton
   (function (lc (list-of lcv)) lcv)
   lc lcv))
(with-profiling
    (pprint
     (solve-skeleton-one-try lc-skeleton lc-examples
                     '((safe-nth lcv) (clo lcv) (cons (list-of lcv)))))
  (terpri))
#+end_src

#+RESULTS:
#+begin_example :load no
  <INFO> [18:49:50] genrec - Profiling started
  <INFO> [18:49:51] genrec - Search stopped, 12854 accepted proposals.

((SAFE-NTH (TRYABLE 4) (CONS (TRYABLE 1) (TRYABLE 2))) (TRYABLE 4) (TRYABLE 5)
 (TRYABLE 1) (CONS (BOT) (TRYABLE 4)) (SAFE-NTH (TRYABLE 0) (TRYABLE 2))
 (SAFE-NTH (TRYABLE 0) (NIL)) (CLO (TRYABLE 8) (TRYABLE 3)) (TRYABLE 5)
 (TRYABLE 7) (TRYABLE 1) (CONS (TRYABLE 3) (TRYABLE 6)) (TRYABLE 0)
 (CLO (TRYABLE 4) (TRYABLE 2)) (TRYABLE 1) (TRYABLE 3) (TRYABLE 0) (TRYABLE 2)
 (TRYABLE 0) (TRYABLE 2) (CONS (TRYABLE 4) (TRYABLE 8)) (TRYABLE 5) (TRYABLE 0)
 (SAFE-NTH (ZERO) (CONS (SAFE-NTH (ZERO) (NIL)) (NIL))) (TRYABLE 0) (TRYABLE 1)
 (TRYABLE 4) (TRYABLE 1) (TRYABLE 3) (TRYABLE 0))
  <INFO> [18:49:51] genrec - Profiling ended. 17397 programs, 12853 accepted, 313146 evaluations, 875 evaluation errors, 0.582 s real time, 29878.5 p/s, 537813.1 e/s.
#+end_example

#+RESULTS:
#+begin_example :load no
  <INFO> [18:49:40] genrec - Profiling started
  <INFO> [18:49:40] genrec - Search stopped, 12277 accepted proposals.

((TRYABLE 0) (TRYABLE 2) (CONS (TRYABLE 0) (CONS (BOT) (TRYABLE 1)))
 (TRYABLE 3) (TRYABLE 0) (SAFE-NTH (TRYABLE 0) (TRYABLE 2))
 (SAFE-NTH (TRYABLE 0) (NIL)) (TRYABLE 5) (TRYABLE 2) (TRYABLE 1) (TRYABLE 1)
 (TRYABLE 6) (CLO (TRYABLE 4) (TRYABLE 2)) (SAFE-NTH (ZERO) (NIL)) (TRYABLE 2)
 (CONS (CLO (CONS (BOT) (NIL)) (TRYABLE 1)) (TRYABLE 3)) (TRYABLE 1)
 (TRYABLE 2) (TRYABLE 0) (TRYABLE 2) (CONS (TRYABLE 3) (TRYABLE 8)) (TRYABLE 4)
 (TRYABLE 7) (SAFE-NTH (ZERO) (NIL)) (TRYABLE 1) (TRYABLE 2) (TRYABLE 4)
 (TRYABLE 0) (CONS (SAFE-NTH (ZERO) (TRYABLE 3)) (TRYABLE 3)) (TRYABLE 0))
  <INFO> [18:49:40] genrec - Profiling ended. 16944 programs, 12276 accepted, 304992 evaluations, 992 evaluation errors, 0.556 s real time, 30468.4 p/s, 548430.4 e/s.
#+end_example

#+RESULTS:
#+begin_example :load no
  <INFO> [18:49:31] genrec - Profiling started
  <INFO> [18:49:31] genrec - Search stopped, 13770 accepted proposals.

((SAFE-NTH (TRYABLE 4) (TRYABLE 6)) (TRYABLE 4) (CONS (TRYABLE 0) (TRYABLE 1))
 (TRYABLE 1) (TRYABLE 4) (SAFE-NTH (TRYABLE 0) (TRYABLE 2))
 (CLO (TRYABLE 2) (TRYABLE 1)) (CLO (TRYABLE 8) (TRYABLE 3)) (TRYABLE 5)
 (TRYABLE 1) (TRYABLE 5) (TRYABLE 6) (CLO (NIL) (VAR (ZERO)))
 (CLO (CONS (TRYABLE 0) (TRYABLE 4)) (TRYABLE 2)) (TRYABLE 1) (TRYABLE 3)
 (TRYABLE 0) (TRYABLE 2) (TRYABLE 1) (TRYABLE 6) (TRYABLE 8) (TRYABLE 1)
 (CONS (TRYABLE 2) (TRYABLE 7)) (TRYABLE 1) (TRYABLE 1) (TRYABLE 2) (TRYABLE 4)
 (TRYABLE 0) (TRYABLE 3) (TRYABLE 0))
  <INFO> [18:49:31] genrec - Profiling ended. 18851 programs, 13769 accepted, 339318 evaluations, 1071 evaluation errors, 0.638 s real time, 29559.9 p/s, 532078.3 e/s.
#+end_example

#+RESULTS:
#+begin_example :load no
  <INFO> [18:49:20] genrec - Profiling started
  <INFO> [18:49:21] genrec - Search stopped, 19179 accepted proposals.

((SAFE-NTH (ZERO) (NIL)) (TRYABLE 2)
 (CONS (CLO (NIL) (VAR (ZERO))) (CONS (TRYABLE 0) (TRYABLE 1))) (TRYABLE 3)
 (TRYABLE 0) (SAFE-NTH (TRYABLE 0) (TRYABLE 2)) (SAFE-NTH (TRYABLE 0) (NIL))
 (CLO (TRYABLE 8) (TRYABLE 6)) (TRYABLE 2) (TRYABLE 1) (TRYABLE 5) (TRYABLE 6)
 (CLO (TRYABLE 4) (TRYABLE 2)) (TRYABLE 0) (TRYABLE 1) (TRYABLE 3) (TRYABLE 0)
 (TRYABLE 2) (TRYABLE 1) (TRYABLE 5) (TRYABLE 8) (TRYABLE 1)
 (CONS (TRYABLE 3) (TRYABLE 7)) (TRYABLE 0) (TRYABLE 0) (TRYABLE 1) (TRYABLE 4)
 (TRYABLE 1) (TRYABLE 3) (TRYABLE 0))
  <INFO> [18:49:21] genrec - Profiling ended. 26501 programs, 19178 accepted, 477018 evaluations, 1411 evaluation errors, 0.881 s real time, 30089.5 p/s, 541611.1 e/s.
#+end_example

#+RESULTS:
#+begin_example :load no
  <INFO> [18:49:10] genrec - Profiling started
  <INFO> [18:49:11] genrec - Search stopped, 10903 accepted proposals.

((TRYABLE 1) (TRYABLE 4) (TRYABLE 5) (TRYABLE 3) (TRYABLE 0)
 (SAFE-NTH (TRYABLE 0) (TRYABLE 2)) (SAFE-NTH (TRYABLE 0) (NIL))
 (CLO (TRYABLE 8) (TRYABLE 6)) (TRYABLE 6) (TRYABLE 1) (TRYABLE 1) (TRYABLE 0)
 (CLO (TRYABLE 4) (TRYABLE 2)) (TRYABLE 0) (TRYABLE 1) (TRYABLE 3) (TRYABLE 0)
 (CONS (CLO (NIL) (VAR (ZERO))) (TRYABLE 2)) (TRYABLE 0) (TRYABLE 2)
 (CONS (TRYABLE 3) (TRYABLE 1)) (TRYABLE 6) (CONS (BOT) (TRYABLE 7))
 (TRYABLE 1) (TRYABLE 1) (TRYABLE 2) (TRYABLE 4) (TRYABLE 0) (TRYABLE 3)
 (TRYABLE 0))
  <INFO> [18:49:11] genrec - Profiling ended. 14588 programs, 10902 accepted, 262584 evaluations, 748 evaluation errors, 0.789 s real time, 18480.3 p/s, 332646.3 e/s.
#+end_example

#+begin_src lisp :load no :results output verbatim
(def lc-skeleton
  (population-skeleton
   (function ((list-of lcv) lcv lc) lcv)
   (function (lc (list-of lcv) lcv) lcv)
   (function (lcv lc (list-of lcv)) lcv)
   (function (lc (list-of lcv)) lcv)))
(with-profiling
  (pprint
   (solve-skeleton-one-try lc-skeleton lc-examples
                           '((safe-nth lcv) (clo lcv) (cons (list-of lcv)))))
  (terpri))
#+end_src

